mysql/location/log/20260818.124835.name.0032.txt
sysbench 1.1.1-94740b0 (using system LuaJIT 2.1.1767980792)

Running the test with following options:
Number of threads: 32
Report intermediate results every 1 second(s)
Initializing random number generator from current time


Initializing worker threads...

Preparing queriesPreparing queries
Preparing queries
Preparing queries
Preparing queries
[...]

Preparing queries
Preparing queries
Preparing queries
[...]
Threads started!

[ 1s ] thds: 32 tps: 152.35 qps: 334.58 (r/w/o: 334.58/0.00/0.00) lat (ms,95%): 240.02 err/s: 0.00 reconn/s: 0.00
[ 2s ] thds: 32 tps: 151.13 qps: 303.25 (r/w/o: 303.25/0.00/0.00) lat (ms,95%): 297.92 err/s: 0.00 reconn/s: 0.00
[ 3s ] thds: 32 tps: 168.53 qps: 336.06 (r/w/o: 336.06/0.00/0.00) lat (ms,95%): 262.64 err/s: 0.00 reconn/s: 0.00
[ 4s ] thds: 32 tps: 161.45 qps: 324.91 (r/w/o: 324.91/0.00/0.00) lat (ms,95%): 248.83 err/s: 0.00 reconn/s: 0.00
[ 5s ] thds: 32 tps: 166.53 qps: 331.07 (r/w/o: 331.07/0.00/0.00) lat (ms,95%): 240.02 err/s: 0.00 reconn/s: 0.00
[ 6s ] thds: 32 tps: 163.04 qps: 327.09 (r/w/o: 327.09/0.00/0.00) lat (ms,95%): 240.02 err/s: 0.00 reconn/s: 0.00
[ 7s ] thds: 32 tps: 164.72 qps: 329.43 (r/w/o: 329.43/0.00/0.00) lat (ms,95%): 240.02 err/s: 0.00 reconn/s: 0.00
[ 8s ] thds: 32 tps: 166.70 qps: 333.41 (r/w/o: 333.41/0.00/0.00) lat (ms,95%): 248.83 err/s: 0.00 reconn/s: 0.00
[ 9s ] thds: 32 tps: 166.07 qps: 330.15 (r/w/o: 330.15/0.00/0.00) lat (ms,95%): 244.38 err/s: 0.00 reconn/s: 0.00
[ 10s ] thds: 32 tps: 167.45 qps: 335.89 (r/w/o: 335.89/0.00/0.00) lat (ms,95%): 235.74 err/s: 0.00 reconn/s: 0.00
[ 11s ] thds: 32 tps: 169.60 qps: 336.19 (r/w/o: 336.19/0.00/0.00) lat (ms,95%): 248.83 err/s: 0.00 reconn/s: 0.00
[ 12s ] thds: 32 tps: 154.78 qps: 312.56 (r/w/o: 312.56/0.00/0.00) lat (ms,95%): 287.38 err/s: 0.00 reconn/s: 0.00
[ 13s ] thds: 32 tps: 167.64 qps: 335.28 (r/w/o: 335.28/0.00/0.00) lat (ms,95%): 248.83 err/s: 0.00 reconn/s: 0.00
[ 14s ] thds: 32 tps: 163.40 qps: 324.79 (r/w/o: 324.79/0.00/0.00) lat (ms,95%): 257.95 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 32 tps: 164.18 qps: 331.37 (r/w/o: 331.37/0.00/0.00) lat (ms,95%): 244.38 err/s: 0.00 reconn/s: 0.00
[ 16s ] thds: 32 tps: 163.85 qps: 327.69 (r/w/o: 327.69/0.00/0.00) lat (ms,95%): 244.38 err/s: 0.00 reconn/s: 0.00
[ 17s ] thds: 32 tps: 166.31 qps: 332.62 (r/w/o: 332.62/0.00/0.00) lat (ms,95%): 244.38 err/s: 0.00 reconn/s: 0.00
[ 18s ] thds: 32 tps: 167.72 qps: 333.45 (r/w/o: 333.45/0.00/0.00) lat (ms,95%): 235.74 err/s: 0.00 reconn/s: 0.00
[ 19s ] thds: 32 tps: 155.54 qps: 314.08 (r/w/o: 314.08/0.00/0.00) lat (ms,95%): 244.38 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 32 tps: 157.25 qps: 314.49 (r/w/o: 314.49/0.00/0.00) lat (ms,95%): 272.27 err/s: 0.00 reconn/s: 0.00
[ 21s ] thds: 32 tps: 166.77 qps: 333.55 (r/w/o: 333.55/0.00/0.00) lat (ms,95%): 240.02 err/s: 0.00 reconn/s: 0.00
[ 22s ] thds: 32 tps: 162.37 qps: 324.74 (r/w/o: 324.74/0.00/0.00) lat (ms,95%): 244.38 err/s: 0.00 reconn/s: 0.00
[ 23s ] thds: 32 tps: 168.22 qps: 333.43 (r/w/o: 333.43/0.00/0.00) lat (ms,95%): 240.02 err/s: 0.00 reconn/s: 0.00
[ 24s ] thds: 32 tps: 161.44 qps: 325.87 (r/w/o: 325.87/0.00/0.00) lat (ms,95%): 240.02 err/s: 0.00 reconn/s: 0.00
[ 25s ] thds: 32 tps: 158.47 qps: 316.93 (r/w/o: 316.93/0.00/0.00) lat (ms,95%): 257.95 err/s: 0.00 reconn/s: 0.00
[ 26s ] thds: 32 tps: 116.10 qps: 231.19 (r/w/o: 231.19/0.00/0.00) lat (ms,95%): 344.08 err/s: 0.00 reconn/s: 0.00
[ 27s ] thds: 32 tps: 144.56 qps: 289.13 (r/w/o: 289.13/0.00/0.00) lat (ms,95%): 397.39 err/s: 0.00 reconn/s: 0.00
[ 28s ] thds: 32 tps: 128.47 qps: 256.95 (r/w/o: 256.95/0.00/0.00) lat (ms,95%): 344.08 err/s: 0.00 reconn/s: 0.00
[ 29s ] thds: 32 tps: 144.55 qps: 287.10 (r/w/o: 287.10/0.00/0.00) lat (ms,95%): 297.92 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 32 tps: 160.87 qps: 322.74 (r/w/o: 322.74/0.00/0.00) lat (ms,95%): 240.02 err/s: 0.00 reconn/s: 0.00
[ 31s ] thds: 32 tps: 165.13 qps: 332.27 (r/w/o: 332.27/0.00/0.00) lat (ms,95%): 253.35 err/s: 0.00 reconn/s: 0.00
[ 32s ] thds: 32 tps: 169.04 qps: 334.08 (r/w/o: 334.08/0.00/0.00) lat (ms,95%): 240.02 err/s: 0.00 reconn/s: 0.00
[ 33s ] thds: 32 tps: 154.76 qps: 312.52 (r/w/o: 312.52/0.00/0.00) lat (ms,95%): 244.38 err/s: 0.00 reconn/s: 0.00
[ 34s ] thds: 32 tps: 162.15 qps: 324.29 (r/w/o: 324.29/0.00/0.00) lat (ms,95%): 248.83 err/s: 0.00 reconn/s: 0.00
[ 35s ] thds: 32 tps: 172.06 qps: 344.11 (r/w/o: 344.11/0.00/0.00) lat (ms,95%): 235.74 err/s: 0.00 reconn/s: 0.00
[ 36s ] thds: 32 tps: 163.30 qps: 326.61 (r/w/o: 326.61/0.00/0.00) lat (ms,95%): 235.74 err/s: 0.00 reconn/s: 0.00
[ 37s ] thds: 32 tps: 160.48 qps: 321.96 (r/w/o: 321.96/0.00/0.00) lat (ms,95%): 240.02 err/s: 0.00 reconn/s: 0.00
[ 38s ] thds: 32 tps: 161.99 qps: 322.97 (r/w/o: 322.97/0.00/0.00) lat (ms,95%): 244.38 err/s: 0.00 reconn/s: 0.00
[ 39s ] thds: 32 tps: 164.00 qps: 327.00 (r/w/o: 327.00/0.00/0.00) lat (ms,95%): 244.38 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 32 tps: 166.00 qps: 332.00 (r/w/o: 332.00/0.00/0.00) lat (ms,95%): 240.02 err/s: 0.00 reconn/s: 0.00
[ 41s ] thds: 32 tps: 167.12 qps: 333.24 (r/w/o: 333.24/0.00/0.00) lat (ms,95%): 244.38 err/s: 0.00 reconn/s: 0.00
[ 42s ] thds: 32 tps: 164.12 qps: 329.24 (r/w/o: 329.24/0.00/0.00) lat (ms,95%): 244.38 err/s: 0.00 reconn/s: 0.00
[ 43s ] thds: 32 tps: 166.44 qps: 330.88 (r/w/o: 330.88/0.00/0.00) lat (ms,95%): 240.02 err/s: 0.00 reconn/s: 0.00
[ 44s ] thds: 32 tps: 162.18 qps: 327.35 (r/w/o: 327.35/0.00/0.00) lat (ms,95%): 240.02 err/s: 0.00 reconn/s: 0.00
[ 45s ] thds: 32 tps: 164.03 qps: 328.06 (r/w/o: 328.06/0.00/0.00) lat (ms,95%): 244.38 err/s: 0.00 reconn/s: 0.00
[ 46s ] thds: 32 tps: 153.41 qps: 306.81 (r/w/o: 306.81/0.00/0.00) lat (ms,95%): 287.38 err/s: 0.00 reconn/s: 0.00
[ 47s ] thds: 32 tps: 164.90 qps: 326.80 (r/w/o: 326.80/0.00/0.00) lat (ms,95%): 240.02 err/s: 0.00 reconn/s: 0.00
[ 48s ] thds: 32 tps: 168.55 qps: 339.09 (r/w/o: 339.09/0.00/0.00) lat (ms,95%): 240.02 err/s: 0.00 reconn/s: 0.00
[ 49s ] thds: 32 tps: 153.98 qps: 309.96 (r/w/o: 309.96/0.00/0.00) lat (ms,95%): 253.35 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 32 tps: 160.01 qps: 317.03 (r/w/o: 317.03/0.00/0.00) lat (ms,95%): 248.83 err/s: 0.00 reconn/s: 0.00
[ 51s ] thds: 32 tps: 160.62 qps: 323.25 (r/w/o: 323.25/0.00/0.00) lat (ms,95%): 244.38 err/s: 0.00 reconn/s: 0.00
[ 52s ] thds: 32 tps: 158.64 qps: 316.27 (r/w/o: 316.27/0.00/0.00) lat (ms,95%): 248.83 err/s: 0.00 reconn/s: 0.00
[ 53s ] thds: 32 tps: 159.79 qps: 321.58 (r/w/o: 321.58/0.00/0.00) lat (ms,95%): 244.38 err/s: 0.00 reconn/s: 0.00
[ 54s ] thds: 32 tps: 158.01 qps: 316.03 (r/w/o: 316.03/0.00/0.00) lat (ms,95%): 244.38 err/s: 0.00 reconn/s: 0.00
[ 55s ] thds: 32 tps: 159.65 qps: 318.29 (r/w/o: 318.29/0.00/0.00) lat (ms,95%): 244.38 err/s: 0.00 reconn/s: 0.00
[ 56s ] thds: 32 tps: 158.79 qps: 317.57 (r/w/o: 317.57/0.00/0.00) lat (ms,95%): 244.38 err/s: 0.00 reconn/s: 0.00
[ 57s ] thds: 32 tps: 159.60 qps: 320.20 (r/w/o: 320.20/0.00/0.00) lat (ms,95%): 248.83 err/s: 0.00 reconn/s: 0.00
[ 58s ] thds: 32 tps: 158.67 qps: 317.33 (r/w/o: 317.33/0.00/0.00) lat (ms,95%): 248.83 err/s: 0.00 reconn/s: 0.00
[ 59s ] thds: 32 tps: 160.70 qps: 321.40 (r/w/o: 321.40/0.00/0.00) lat (ms,95%): 244.38 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 32 tps: 163.05 qps: 324.09 (r/w/o: 324.09/0.00/0.00) lat (ms,95%): 240.02 err/s: 0.00 reconn/s: 0.00
Latency histogram (values are in milliseconds)
       value  ------------- distribution ------------- count
      61.083 |                                         1
      78.597 |                                         1
      84.467 |                                         2
      90.775 |                                         2
      94.104 |                                         2
      95.814 |                                         1
      97.555 |                                         1
      99.327 |                                         1
     101.132 |                                         2
     102.969 |*                                        6
     104.840 |                                         3
     106.745 |                                         2
     108.685 |                                         5
     110.659 |                                         3
     112.670 |*                                        8
     114.717 |                                         4
     116.802 |*                                        6
     118.924 |*                                        12
     121.085 |*                                        8
     123.285 |**                                       21
     125.525 |*                                        15
     127.805 |**                                       20
     130.128 |***                                      34
     132.492 |***                                      32
     134.899 |****                                     43
     137.350 |****                                     49
     139.846 |****                                     52
     142.387 |******                                   66
     144.974 |******                                   74
     147.608 |*******                                  81
     150.290 |********                                 95
     153.021 |***********                              132
     155.801 |************                             145
     158.632 |*************                            149
     161.514 |****************                         188
     164.449 |*****************                        202
     167.437 |********************                     230
     170.479 |**********************                   262
     173.577 |*************************                295
     176.731 |****************************             325
     179.942 |*******************************          359
     183.211 |********************************         375
     186.540 |***********************************      406
     189.929 |*************************************    430
     193.380 |*************************************    431
     196.894 |************************************     423
     200.472 |**************************************** 469
     204.114 |**************************************   442
     207.823 |*************************************    431
     211.599 |*********************************        388
     215.443 |*******************************          364
     219.358 |*********************************        392
     223.344 |*******************************          369
     227.402 |*************************                290
     231.534 |**********************                   257
     235.740 |*****************                        204
     240.024 |*****************                        198
     244.385 |***************                          180
     248.825 |**********                               122
     253.346 |********                                 96
     257.950 |******                                   73
     262.636 |******                                   68
     267.408 |****                                     50
     272.267 |****                                     52
     277.214 |**                                       28
     282.251 |**                                       20
     287.379 |**                                       25
     292.601 |*                                        16
     297.917 |**                                       21
     303.330 |*                                        10
     308.842 |*                                        10
     314.453 |*                                        10
     320.167 |*                                        10
     325.984 |                                         5
     331.907 |*                                        11
     337.938 |                                         3
     344.078 |*                                        7
     350.330 |                                         3
     356.695 |                                         4
     363.176 |                                         4
     369.775 |*                                        8
     376.494 |*                                        6
     383.334 |                                         2
     390.299 |                                         2
     397.391 |                                         3
     404.611 |                                         1
     411.963 |                                         2
     419.448 |                                         2
     539.710 |                                         1
 
SQL statistics:
    queries performed:
        read:                            19326
        write:                           0
        other:                           0
        total:                           19326
    transactions:                        9663   (160.75 per sec.)
    queries:                             19326  (321.50 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      160.7484
    time elapsed:                        60.1126s
    total number of events:              9663

Latency (ms):
         min:                                  61.297
         avg:                                 198.954
         max:                                 537.998
         95th percentile:                     253.346
         sum:                             1922496.675

Threads fairness:
    events (avg/stddev):           301.9688/2.13
    execution time (avg/stddev):   60.0780/0.03